tutorials/chtMultiRegionFoam/multiRegionHeater/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         180;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   5;
//writeControl    timeStep;
//writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.3;

adjustTimeStep  yes;


// ************************************************************************* //
